# Inserting Title Basics and Ratings Data

![png](Movies-ERD.png)

In [1]:
import sqlalchemy
sqlalchemy.__version__
# imports
import pandas as pd
from sqlalchemy import create_engine
pd.set_option('display.max_columns',50)

In [2]:
# Creating the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
# Previewing the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

### Checking genres & title_genres

In [4]:
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [5]:
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, conn)
describe

      Field         Type Null  Key Default Extra
0    tconst  varchar(10)   NO  PRI    None
1  genre_id          int   NO  PRI    None

### Checking / Cleaning title_basics

In [6]:
title_basics = pd.read_csv('data/basics_filtered.csv')
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [7]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, conn)
describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(10)   NO  PRI    None
1  primary_title  varchar(242)  YES         None
2     start_year         float  YES         None
3        runtime           int  YES         None

In [8]:
title_basics.rename(columns={"primaryTitle":"primary_title"}, inplace=True)
title_basics.rename(columns={"startYear":"start_year"}, inplace=True)
title_basics.rename(columns={"runtimeMinutes":"runtime"}, inplace=True)
title_basics.dtypes

tconst            object
titleType         object
primary_title     object
originalTitle     object
isAdult            int64
start_year       float64
endYear          float64
runtime            int64
genres            object
dtype: object

In [9]:
temp_title_basics = title_basics.drop(columns=["titleType","originalTitle","isAdult","endYear","genres"])
temp_title_basics.dtypes

tconst            object
primary_title     object
start_year       float64
runtime            int64
dtype: object

In [ ]:
#inserting data
temp_title_basics.to_sql("title_basics",conn,index=False, if_exists='append')

In [12]:
# confirm the data has been added
q = """SELECT * FROM title_basics;"""
pd.read_sql(q,conn)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126
...,...,...,...,...
86974,tt9914942,Life Without Sara Amat,2019.0,74
86975,tt9915872,The Last White Witch,2019.0,97
86976,tt9916170,The Rehearsal,2019.0,51
86977,tt9916190,Safeguard,2020.0,95
86978,tt9916362,Coven,2020.0,92

### Checking / Cleaning ratings

In [13]:
ratings = pd.read_csv('data/ratings_filtered.csv')
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [14]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, conn)
describe

             Field         Type Null  Key Default Extra
0           tconst  varchar(10)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [15]:
ratings.rename(columns={"averageRating":"average_rating"}, inplace=True)
ratings.rename(columns={"numVotes":"number_of_votes"}, inplace=True)
ratings.dtypes

tconst              object
average_rating     float64
number_of_votes      int64
dtype: object

In [ ]:
#inserting data
ratings.to_sql("ratings",conn,index=False, if_exists='append')

In [17]:
# confirm the data has been added
q = """SELECT * FROM ratings;"""
pd.read_sql(q,conn)

          tconst  average_rating  number_of_votes
0      tt0035423             6.4            87153
1      tt0062336             6.4              175
2      tt0069049             6.7             7754
3      tt0088751             5.2              336
4      tt0096056             5.6              846
...          ...             ...              ...
71895  tt9914942             6.6              178
71896  tt9915872             6.4                9
71897  tt9916170             7.0                7
71898  tt9916190             3.7              243
71899  tt9916362             6.4             5422

[71900 rows x 3 columns]

### Confirming Database Updated Correctly

In [18]:
# Previewing the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [19]:
# Checking genres
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [20]:
q = '''SELECT * FROM genres LIMIT 5;'''
describe = pd.read_sql(q, conn)
describe

Empty DataFrame
Columns: [genre_id, genre_name]
Index: []

In [21]:
# Checking title_genres
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, conn)
describe

      Field         Type Null  Key Default Extra
0    tconst  varchar(10)   NO  PRI    None
1  genre_id          int   NO  PRI    None

In [22]:
q = '''SELECT * FROM title_genres LIMIT 5;'''
describe = pd.read_sql(q, conn)
describe

Empty DataFrame
Columns: [tconst, genre_id]
Index: []

In [23]:
# Checking title_basics
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, conn)
describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(10)   NO  PRI    None
1  primary_title  varchar(242)  YES         None
2     start_year         float  YES         None
3        runtime           int  YES         None

In [24]:
q = '''SELECT * FROM title_basics LIMIT 5;'''
describe = pd.read_sql(q, conn)
describe

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [25]:
# Checking ratings
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, conn)
describe

             Field         Type Null  Key Default Extra
0           tconst  varchar(10)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [26]:
q = '''SELECT * FROM ratings LIMIT 5;'''
describe = pd.read_sql(q, conn)
describe

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846